index.tex
% Created 2020-03-31 Tue 16:45
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{nopageno}
\usepackage[margin=0.5in, a4paper]{geometry}
\voffset=-30pt
\parindent=0pt
\usepackage{enumitem}
\setitemize{noitemsep}
\usepackage[compact]{titlesec}
\usepackage{parskip}
\date{}
\title{\vspace{-4ex}\textbf{Connor Parsons}\\\medskip
\large Software Engineer\\\begin{normalsize}\href{https:linkedin.com/in/connorparsons}{linkedin.com/in/connorparsons} \textbullet{} \href{https:github.com/connorgreyparsons}{github.com/connorgreyparsons} \textbullet{} \href{mailto:cgreyparsons@gmail.com}{cgreyparsons@gmail.com} \textbullet{} \href{tel:8505436369}{(850) 543-6369}\vspace{-12ex}\end{normalsize}}
\hypersetup{
 pdfauthor={cpars},
 pdftitle={\vspace{-4ex}\textbf{Connor Parsons}},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{\underline{Technical Skills}}
\label{sec:orgea01e3b}
Javascript, Node.js, C\#, SQL, C/C++, Scheme, HTML, CSS, Express.js, Electron, React, MongoDB, Webpack,
\\Git, AWS (VPC, EC2, RDS, S3, Lambda, API Gateway, etc), Linux, Emacs

\section*{\underline{Experience}}
\label{sec:orgfbdc088}
\subsection*{DXC Technology | {\scriptsize New Orleans, LA}}
\label{sec:orgaf8b444}
\textbf{Software Engineer} \\Jan. 2019 - current
\begin{itemize}
\item \textbf{CBS}
\begin{itemize}
\item Used React, Redux, and Sagas for creating components and connecting to API
\item Wrote user authentication logic using the Okta library to connect with existing Single Sign On
\item Collaborated with international team across multiple timezones
\end{itemize}
\item \textbf{Global Payments}
\begin{itemize}
\item Used Node and Electron to create desktop application that accepts file uploads
\item Parsed, normalized, and diffed file uploads, output detailed TSV report showing variance between files
\item Participated in code reviews and unit testing
\end{itemize}
\item \textbf{HPE}
\begin{itemize}
\item Used C\# and WinForms to create desktop application and background processes
\item Implemented dynamically generated SQLite database tables to retain user data and push to central server
\item Made system calls in separate threads to monitor client device
\end{itemize}
\item \textbf{Internal Talent Management Tool}
\begin{itemize}
\item Planned and implemented application architecture using AWS resources (EC2, VPC, Lambda, RDS)
\item Designed table schema for PostgreSQL database
\item Wrote an AWS Lambda function (Node.js) to consume and parse nested JSON objects and write changes to database
\end{itemize}
\end{itemize}
\subsection*{Interactive Information Systems | {\scriptsize New Orleans, LA}}
\label{sec:orgac03843}
\textbf{Software Engineer} \\Aug. 2017 - Dec. 2018
\begin{itemize}
\item \textbf{First American Bankcard}
\begin{itemize}
\item Developed a reporting dashboard to query transaction and customer data and download reports in PDF and Excel formats
\item Used AWS Lambda to periodically run a function that pulls CSV files from an S3 bucket to parse and insert into a SQL database
\item Participated in client meetings to discuss progress and planning of new features
\end{itemize}
\item \textbf{Jefferson Parish Juvenile Court}
\begin{itemize}
\item Built a dashboard to query user data and progress users through different stages of the program
\item Developed a console application using Twilio to pull user data from a SQL database and send SMS notifications to clients based on progress in the program
\item Designed and developed application for court staff to review cases, process and upload necessary documents, schedule meetings, and email iCal events to relevant parties
\end{itemize}
\end{itemize}

\section*{\underline{Education}}
\label{sec:orgf8a6906}
\subsection*{Louisiana State University | {\scriptsize Baton Rouge, LA}}
\label{sec:org92d8c7c}
\begin{itemize}
\item Bachelor's Degree, Interdisciplinary Studies \\May 2019
\end{itemize}
\end{document}
